
a = b = 2  		# Пример множественного оператора присваивания. 
# Обратите внимание на значения переменных a и b после выполнения данной операции. 

print("a = " + str(a))   #  Функция str() используется для приведения типа аргумента к строковому 
print("b = " + "str(b)")

print("b = " + str(b))

hello = "Привет"
print("hello = " + str(hello)) 

# Переопределите значение переменной hello 
hello = 234
print("hello = " + str(hello))

hello = "kak dela?"
print("hello = " + str(hello))

# Создайте ещё несколько переменных, а затем осуществите их вывод через пробел 

x=3.22
y=12
z=-54

print("x = " + str(x), "\ny = " + str(y), "\nz = " + str(z))

